// Ім'я файлу має бути чітко заданим як в прикладі
// Щоб створити файл package.json треба ввести команду: "npm init -y"

// Приклад варто створити з нуля
module.exports = {
    // mode - вказівка режиму над котрим зараз працюємо з проектом.
    // 'development' - режим компіляції коду для розробки
    // 'production'  - режим компіляції коду для публікування в інтернеті  
    mode: 'production'
}

// Прописати команду npm run build!
// build команда прописана в файлі package.json
// Запустивши команду webpack автоматично перемістить в папку "dist" новий файл main.js
